# RadiusX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..RadiusX Property
Ellipse Class See Also
---
Returns the X vector radius of the ellipse.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double RadiusX { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RadiusX As Double
	Get
```

Visual C++
---
```text
public:
property double RadiusX {
	double get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace